apache/nuttx/arch/arm/src/ra8m1/ra_clockconfig.h
/****************************************************************************
 * arch/arm/src/ra8m1/ra_clockconfig.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RA8M1_RA_CLOCKCONFIG_H
#define __ARCH_ARM_SRC_RA8M1_RA_CLOCKCONFIG_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <arch/board/board.h>

#include "hardware/ra8m1_system.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Clock frequencies derived from the BOARD_* clock options.
 *
 * The clock tree is chosen by the board in <arch/board/board.h> (see the
 * "Clocking" section of that file for every option and its valid values).
 * Everything here is a compile-time constant, and every limit in the RA8M1
 * User's Manual chapter 8 (Tables 8.1 and 8.2 and their notes) is checked
 * with #error, so a missing option or an invalid combination fails to build
 * instead of producing a clock the MCU is not specified for.  Some of the
 * results are unsigned long long constants (the PLL VCO does not fit in 32
 * bits during the calculation); cast them where a plain integer is needed.
 */

/* Options the board has to define.  There is no default: a board.h that
 * does not describe its clock tree does not build.
 */

#ifndef BOARD_HOCO_FREQUENCY
#  error "board.h must define BOARD_HOCO_FREQUENCY"
#endif
#ifndef BOARD_SYSCLK_SOURCE
#  error "board.h must define BOARD_SYSCLK_SOURCE"
#endif
#ifndef BOARD_OFS2_DCDC
#  error "board.h must define BOARD_OFS2_DCDC"
#endif
#if !defined(BOARD_CPUCLK_DIVIDER) || !defined(BOARD_ICLK_DIVIDER)  || \
    !defined(BOARD_PCLKA_DIVIDER)  || !defined(BOARD_PCLKB_DIVIDER) || \
    !defined(BOARD_PCLKC_DIVIDER)  || !defined(BOARD_PCLKD_DIVIDER) || \
    !defined(BOARD_PCLKE_DIVIDER)  || !defined(BOARD_FCLK_DIVIDER)  || \
    !defined(BOARD_BCLK_DIVIDER)
#  error "board.h must define BOARD_CPUCLK/ICLK/PCLKA-E/FCLK/BCLK_DIVIDER"
#endif

/* SCICLK source selectors, for BOARD_SCICLK_SOURCE.
 *
 * Every other *_SOURCE option reuses the real register-field value from
 * hardware/ra8m1_system.h (see board.h).  SCICKCR.SCICKSEL has no such
 * generated names -- the SVD gives this field no enumeratedValues -- so
 * this is the one selector this port has to invent, and it is kept here,
 * private to this file, rather than in board.h: board.h only references
 * these names (no #include needed for that -- a macro's replacement text
 * is resolved where it is used, not where it is written), and the actual
 * SCICKCR.SCICKSEL codes these translate to are computed in
 * ra_clockconfig.c, independently of the numbering used here.
 */

#define RA_SCICLK_SRC_MOCO        1
#define RA_SCICLK_SRC_HOCO        2
#define RA_SCICLK_SRC_MOSC        3
#define RA_SCICLK_SRC_PLL1P       4
#define RA_SCICLK_SRC_PLL1Q       5
#define RA_SCICLK_SRC_PLL1R       6
#define RA_SCICLK_SRC_PLL2P       7
#define RA_SCICLK_SRC_PLL2Q       8
#define RA_SCICLK_SRC_PLL2R       9

/* Which oscillators, PLLs and dedicated clocks the configuration needs.
 * Each RA_USE_* is 0 or 1.
 *
 * SCICLK is needed as soon as one SCI UART is enabled: the baud rate
 * generator of every SCI runs from it.
 */

#if defined(CONFIG_RA_SCI0_UART) || defined(CONFIG_RA_SCI1_UART) || \
    defined(CONFIG_RA_SCI2_UART) || defined(CONFIG_RA_SCI3_UART) || \
    defined(CONFIG_RA_SCI4_UART) || defined(CONFIG_RA_SCI9_UART)
#  define RA_USE_SCICLK           1
#else
#  define RA_USE_SCICLK           0
#endif

#if RA_USE_SCICLK
#  if !defined(BOARD_SCICLK_SOURCE) || !defined(BOARD_SCICLK_DIVIDER)
#    error "board.h must define BOARD_SCICLK_SOURCE and BOARD_SCICLK_DIVIDER"
#  endif
#endif

#if BOARD_SYSCLK_SOURCE == R_SYSTEM_SCKSCR_CKSEL_PLL || \
    (RA_USE_SCICLK && (BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL1P || \
                       BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL1Q || \
                       BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL1R))
#  define RA_USE_PLL1             1
#else
#  define RA_USE_PLL1             0
#endif

#if RA_USE_SCICLK && (BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL2P || \
                      BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL2Q || \
                      BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL2R)
#  define RA_USE_PLL2             1
#else
#  define RA_USE_PLL2             0
#endif

#if RA_USE_PLL1
#  if !defined(BOARD_PLL1_SOURCE) || !defined(BOARD_PLL1_INPUT_DIVIDER) || \
      !defined(BOARD_PLL1_MULTIPLIER) || !defined(BOARD_PLL1_MULTIPLIER_FRACTION) || \
      !defined(BOARD_PLL1_DIVIDER_P) || !defined(BOARD_PLL1_DIVIDER_Q) || \
      !defined(BOARD_PLL1_DIVIDER_R)
#    error "PLL1 is used: board.h must define all the BOARD_PLL1_* options"
#  endif
#endif

#if RA_USE_PLL2
#  if !defined(BOARD_PLL2_SOURCE) || !defined(BOARD_PLL2_INPUT_DIVIDER) || \
      !defined(BOARD_PLL2_MULTIPLIER) || !defined(BOARD_PLL2_MULTIPLIER_FRACTION) || \
      !defined(BOARD_PLL2_DIVIDER_P) || !defined(BOARD_PLL2_DIVIDER_Q) || \
      !defined(BOARD_PLL2_DIVIDER_R)
#    error "PLL2 is used: board.h must define all the BOARD_PLL2_* options"
#  endif
#endif

#if BOARD_SYSCLK_SOURCE == R_SYSTEM_SCKSCR_CKSEL_HOCO || \
    (RA_USE_SCICLK && BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_HOCO) || \
    (RA_USE_PLL1 && BOARD_PLL1_SOURCE == R_SYSTEM_PLLCCR_PLSRCSEL) || \
    (RA_USE_PLL2 && BOARD_PLL2_SOURCE == R_SYSTEM_PLL2CCR_PL2SRCSEL)
#  define RA_USE_HOCO             1
#else
#  define RA_USE_HOCO             0
#endif

#if BOARD_SYSCLK_SOURCE == R_SYSTEM_SCKSCR_CKSEL_MAIN_CLOCK_OSCILLATOR || \
    (RA_USE_SCICLK && BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_MOSC) || \
    (RA_USE_PLL1 && BOARD_PLL1_SOURCE == 0) || \
    (RA_USE_PLL2 && BOARD_PLL2_SOURCE == 0)
#  define RA_USE_MOSC             1
#else
#  define RA_USE_MOSC             0
#endif

#if BOARD_SYSCLK_SOURCE != R_SYSTEM_SCKSCR_CKSEL_MOCO && \
    BOARD_SYSCLK_SOURCE != R_SYSTEM_SCKSCR_CKSEL_HOCO && \
    BOARD_SYSCLK_SOURCE != R_SYSTEM_SCKSCR_CKSEL_MAIN_CLOCK_OSCILLATOR && \
    BOARD_SYSCLK_SOURCE != R_SYSTEM_SCKSCR_CKSEL_PLL
#  error "BOARD_SYSCLK_SOURCE must be R_SYSTEM_SCKSCR_CKSEL_MOCO, _HOCO, _MAIN_CLOCK_OSCILLATOR or _PLL"
#endif

/* Oscillators */

