apache/nuttx/arch/arm/src/ra8m1/ra_clockconfig.h
#define RA_MOCO_FREQUENCY         8000000

/* The HOCO frequency after reset is the one programmed into OFS1 (see
 * ra_option_setting.c), so BOARD_HOCO_FREQUENCY is used for both.
 */

#if BOARD_HOCO_FREQUENCY != 16000000 && BOARD_HOCO_FREQUENCY != 18000000 && \
    BOARD_HOCO_FREQUENCY != 20000000 && BOARD_HOCO_FREQUENCY != 32000000 && \
    BOARD_HOCO_FREQUENCY != 48000000
#  error "BOARD_HOCO_FREQUENCY must be 16, 18, 20, 32 or 48 MHz"
#endif

#define RA_HOCO_FREQUENCY         BOARD_HOCO_FREQUENCY

#if RA_USE_MOSC
#  if !defined(BOARD_MOSC_FREQUENCY) || !defined(BOARD_MOSC_EXTERNAL_CLOCK) || \
      !defined(BOARD_MOSC_STABILIZATION_US)
#    error "MOSC is used: board.h must define BOARD_MOSC_FREQUENCY, BOARD_MOSC_EXTERNAL_CLOCK and BOARD_MOSC_STABILIZATION_US"
#  endif
#  if BOARD_MOSC_FREQUENCY < 8000000 || BOARD_MOSC_FREQUENCY > 48000000
#    error "BOARD_MOSC_FREQUENCY must be 8 MHz to 48 MHz"
#  endif
#  if !BOARD_MOSC_EXTERNAL_CLOCK && \
      (BOARD_MOSC_STABILIZATION_US < 12 || BOARD_MOSC_STABILIZATION_US > 31139)
#    error "BOARD_MOSC_STABILIZATION_US must be 12 us to 31139 us"
#  endif
#  define RA_MOSC_FREQUENCY       BOARD_MOSC_FREQUENCY
#endif

/* Divider validity.  The dividers are the values 1, 2, 3, 4, 6, 8, 12, 16,
 * 32 and 64 (SCKDIVCR/SCKDIVCR2 encode them non-linearly).
 */

#define RA_SCKDIV_VALID(d) \
  ((d) == 1 || (d) == 2 || (d) == 3 || (d) == 4 || (d) == 6 || \
   (d) == 8 || (d) == 12 || (d) == 16 || (d) == 32 || (d) == 64)
#define RA_SCKDIV_FAMILY_A(d) \
  ((d) == 2 || (d) == 4 || (d) == 8 || (d) == 16 || (d) == 32 || (d) == 64)
#define RA_SCKDIV_FAMILY_B(d)   ((d) == 3 || (d) == 6 || (d) == 12)

#define RA_PLL_DIV_P_VALID(d) \
  ((d) == 2 || (d) == 4 || (d) == 6 || (d) == 8 || (d) == 16)
#define RA_PLL_DIV_QR_VALID(d) \
  ((d) == 2 || (d) == 3 || (d) == 4 || (d) == 5 || (d) == 6 || \
   (d) == 8 || (d) == 9)

#define RA_SCICLK_DIV_VALID(d) \
  ((d) == 1 || (d) == 2 || (d) == 3 || (d) == 4 || (d) == 5 || \
   (d) == 6 || (d) == 8)

/* PLL1 and PLL2 */

#if RA_USE_PLL1

#  if BOARD_PLL1_SOURCE == 0
#    define RA_PLL1_SOURCE_FREQUENCY  RA_MOSC_FREQUENCY
#  elif BOARD_PLL1_SOURCE == R_SYSTEM_PLLCCR_PLSRCSEL
#    define RA_PLL1_SOURCE_FREQUENCY  RA_HOCO_FREQUENCY
#  else
#    error "BOARD_PLL1_SOURCE must be 0 (MOSC) or R_SYSTEM_PLLCCR_PLSRCSEL (HOCO)"
#  endif

#  if BOARD_PLL1_INPUT_DIVIDER < 1 || BOARD_PLL1_INPUT_DIVIDER > 4
#    error "BOARD_PLL1_INPUT_DIVIDER must be 1 to 4"
#  endif
#  if BOARD_PLL1_MULTIPLIER < 53 || BOARD_PLL1_MULTIPLIER > 180
#    error "BOARD_PLL1_MULTIPLIER must be 53 to 180"
#  endif

#  if BOARD_PLL1_MULTIPLIER_FRACTION == R_SYSTEM_PLLCCR_PLLMULNF_V0_33_1_3
#    define RA_PLL1_MULF6             2      /* 1/3 = 2/6 */
#  elif BOARD_PLL1_MULTIPLIER_FRACTION == R_SYSTEM_PLLCCR_PLLMULNF_V0_50_1_2
#    define RA_PLL1_MULF6             3      /* 1/2 = 3/6 */
#  elif BOARD_PLL1_MULTIPLIER_FRACTION == R_SYSTEM_PLLCCR_PLLMULNF_V0_66_2_3
#    define RA_PLL1_MULF6             4      /* 2/3 = 4/6 */
#  elif BOARD_PLL1_MULTIPLIER_FRACTION == \
        R_SYSTEM_PLLCCR_PLLMULNF_V0_00_VALUE_AFTER_RESET
#    define RA_PLL1_MULF6             0
#  else
#    error "BOARD_PLL1_MULTIPLIER_FRACTION must be one of the R_SYSTEM_PLLCCR_PLLMULNF_* codes"
#  endif

#  define RA_PLL1_INPUT_FREQUENCY     (RA_PLL1_SOURCE_FREQUENCY / BOARD_PLL1_INPUT_DIVIDER)
#  define RA_PLL1_VCO_FREQUENCY \
  ((RA_PLL1_INPUT_FREQUENCY * (6ULL * BOARD_PLL1_MULTIPLIER + RA_PLL1_MULF6)) / 6ULL)
#  define RA_PLL1P_FREQUENCY          (RA_PLL1_VCO_FREQUENCY / BOARD_PLL1_DIVIDER_P)
#  define RA_PLL1Q_FREQUENCY          (RA_PLL1_VCO_FREQUENCY / BOARD_PLL1_DIVIDER_Q)
#  define RA_PLL1R_FREQUENCY          (RA_PLL1_VCO_FREQUENCY / BOARD_PLL1_DIVIDER_R)

#  if RA_PLL1_SOURCE_FREQUENCY < 8000000 || RA_PLL1_SOURCE_FREQUENCY > 48000000
#    error "PLL1 source clock must be 8 MHz to 48 MHz"
#  endif
#  if RA_PLL1_INPUT_FREQUENCY < 6000000 || RA_PLL1_INPUT_FREQUENCY > 12000000
#    error "PLL1 input frequency after the input divider must be 6 MHz to 12 MHz"
#  endif
#  if RA_PLL1_VCO_FREQUENCY < 640000000ULL || RA_PLL1_VCO_FREQUENCY > 1440000000ULL
#    error "PLL1 VCO frequency must be 640 MHz to 1440 MHz"
#  endif
#  if !RA_PLL_DIV_P_VALID(BOARD_PLL1_DIVIDER_P)
#    error "PLL1 output P divider must be 2, 4, 6, 8 or 16"
#  endif
#  if !RA_PLL_DIV_QR_VALID(BOARD_PLL1_DIVIDER_Q) || !RA_PLL_DIV_QR_VALID(BOARD_PLL1_DIVIDER_R)
#    error "PLL1 output Q/R dividers must be 2, 3, 4, 5, 6, 8 or 9"
#  endif
#  if RA_PLL1P_FREQUENCY < 40000000 || RA_PLL1P_FREQUENCY > 480000000
#    error "PLL1P must be 40 MHz to 480 MHz"
#  endif
#  if RA_PLL1Q_FREQUENCY < 71000000 || RA_PLL1Q_FREQUENCY > 480000000
#    error "PLL1Q must be 71 MHz to 480 MHz"
#  endif
#  if RA_PLL1R_FREQUENCY < 71000000 || RA_PLL1R_FREQUENCY > 480000000
#    error "PLL1R must be 71 MHz to 480 MHz"
#  endif

#endif /* RA_USE_PLL1 */

#if RA_USE_PLL2

#  if BOARD_PLL2_SOURCE == 0
#    define RA_PLL2_SOURCE_FREQUENCY  RA_MOSC_FREQUENCY
#  elif BOARD_PLL2_SOURCE == R_SYSTEM_PLL2CCR_PL2SRCSEL
#    define RA_PLL2_SOURCE_FREQUENCY  RA_HOCO_FREQUENCY
#  else
#    error "BOARD_PLL2_SOURCE must be 0 (MOSC) or R_SYSTEM_PLL2CCR_PL2SRCSEL (HOCO)"
#  endif

#  if BOARD_PLL2_INPUT_DIVIDER < 1 || BOARD_PLL2_INPUT_DIVIDER > 4
#    error "BOARD_PLL2_INPUT_DIVIDER must be 1 to 4"
#  endif
#  if BOARD_PLL2_MULTIPLIER < 53 || BOARD_PLL2_MULTIPLIER > 180
#    error "BOARD_PLL2_MULTIPLIER must be 53 to 180"
#  endif

#  if BOARD_PLL2_MULTIPLIER_FRACTION == R_SYSTEM_PLL2CCR_PLL2MULNF_V0_33_1_3
#    define RA_PLL2_MULF6             2      /* 1/3 = 2/6 */
#  elif BOARD_PLL2_MULTIPLIER_FRACTION == R_SYSTEM_PLL2CCR_PLL2MULNF_V0_50_1_2
#    define RA_PLL2_MULF6             3      /* 1/2 = 3/6 */
#  elif BOARD_PLL2_MULTIPLIER_FRACTION == R_SYSTEM_PLL2CCR_PLL2MULNF_V0_66_2_3
#    define RA_PLL2_MULF6             4      /* 2/3 = 4/6 */
#  elif BOARD_PLL2_MULTIPLIER_FRACTION == \
        R_SYSTEM_PLL2CCR_PLL2MULNF_V0_00_VALUE_AFTER_RESET
#    define RA_PLL2_MULF6             0
#  else
#    error "BOARD_PLL2_MULTIPLIER_FRACTION must be one of the R_SYSTEM_PLL2CCR_PLL2MULNF_* codes"
#  endif

#  define RA_PLL2_INPUT_FREQUENCY     (RA_PLL2_SOURCE_FREQUENCY / BOARD_PLL2_INPUT_DIVIDER)
#  define RA_PLL2_VCO_FREQUENCY \
  ((RA_PLL2_INPUT_FREQUENCY * (6ULL * BOARD_PLL2_MULTIPLIER + RA_PLL2_MULF6)) / 6ULL)
#  define RA_PLL2P_FREQUENCY          (RA_PLL2_VCO_FREQUENCY / BOARD_PLL2_DIVIDER_P)
#  define RA_PLL2Q_FREQUENCY          (RA_PLL2_VCO_FREQUENCY / BOARD_PLL2_DIVIDER_Q)
#  define RA_PLL2R_FREQUENCY          (RA_PLL2_VCO_FREQUENCY / BOARD_PLL2_DIVIDER_R)

