apache/nuttx/arch/arm/src/ra8m1/ra_clockconfig.h
#  if RA_PLL2_SOURCE_FREQUENCY < 8000000 || RA_PLL2_SOURCE_FREQUENCY > 48000000
#    error "PLL2 source clock must be 8 MHz to 48 MHz"
#  endif
#  if RA_PLL2_INPUT_FREQUENCY < 6000000 || RA_PLL2_INPUT_FREQUENCY > 12000000
#    error "PLL2 input frequency after the input divider must be 6 MHz to 12 MHz"
#  endif
#  if RA_PLL2_VCO_FREQUENCY < 640000000ULL || RA_PLL2_VCO_FREQUENCY > 1440000000ULL
#    error "PLL2 VCO frequency must be 640 MHz to 1440 MHz"
#  endif
#  if !RA_PLL_DIV_P_VALID(BOARD_PLL2_DIVIDER_P)
#    error "PLL2 output P divider must be 2, 4, 6, 8 or 16"
#  endif
#  if !RA_PLL_DIV_QR_VALID(BOARD_PLL2_DIVIDER_Q) || !RA_PLL_DIV_QR_VALID(BOARD_PLL2_DIVIDER_R)
#    error "PLL2 output Q/R dividers must be 2, 3, 4, 5, 6, 8 or 9"
#  endif
#  if RA_PLL2P_FREQUENCY < 40000000 || RA_PLL2P_FREQUENCY > 480000000
#    error "PLL2P must be 40 MHz to 480 MHz"
#  endif
#  if RA_PLL2Q_FREQUENCY < 71000000 || RA_PLL2Q_FREQUENCY > 480000000
#    error "PLL2Q must be 71 MHz to 480 MHz"
#  endif
#  if RA_PLL2R_FREQUENCY < 71000000 || RA_PLL2R_FREQUENCY > 480000000
#    error "PLL2R must be 71 MHz to 480 MHz"
#  endif

#endif /* RA_USE_PLL2 */

/* System clock source */

#if BOARD_SYSCLK_SOURCE == R_SYSTEM_SCKSCR_CKSEL_HOCO
#  define RA_SYSCLK_FREQUENCY     RA_HOCO_FREQUENCY
#elif BOARD_SYSCLK_SOURCE == R_SYSTEM_SCKSCR_CKSEL_MAIN_CLOCK_OSCILLATOR
#  define RA_SYSCLK_FREQUENCY     RA_MOSC_FREQUENCY
#elif BOARD_SYSCLK_SOURCE == R_SYSTEM_SCKSCR_CKSEL_PLL
#  define RA_SYSCLK_FREQUENCY     RA_PLL1P_FREQUENCY
#else
#  define RA_SYSCLK_FREQUENCY     RA_MOCO_FREQUENCY
#endif

/* Clocks derived from the system clock */

#define RA_CPUCLK_FREQUENCY       (RA_SYSCLK_FREQUENCY / BOARD_CPUCLK_DIVIDER)
#define RA_ICLK_FREQUENCY         (RA_SYSCLK_FREQUENCY / BOARD_ICLK_DIVIDER)
#define RA_PCLKA_FREQUENCY        (RA_SYSCLK_FREQUENCY / BOARD_PCLKA_DIVIDER)
#define RA_PCLKB_FREQUENCY        (RA_SYSCLK_FREQUENCY / BOARD_PCLKB_DIVIDER)
#define RA_PCLKC_FREQUENCY        (RA_SYSCLK_FREQUENCY / BOARD_PCLKC_DIVIDER)
#define RA_PCLKD_FREQUENCY        (RA_SYSCLK_FREQUENCY / BOARD_PCLKD_DIVIDER)
#define RA_PCLKE_FREQUENCY        (RA_SYSCLK_FREQUENCY / BOARD_PCLKE_DIVIDER)
#define RA_FCLK_FREQUENCY         (RA_SYSCLK_FREQUENCY / BOARD_FCLK_DIVIDER)
#define RA_BCLK_FREQUENCY         (RA_SYSCLK_FREQUENCY / BOARD_BCLK_DIVIDER)

/* SCI clock (SCICLK): the clock of the SCI baud rate generator.  When no
 * SCI UART is enabled it is left at its reset value, the MOCO.
 */

#if RA_USE_SCICLK
#  if BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_HOCO
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_HOCO_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_MOSC
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_MOSC_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL1P
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_PLL1P_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL1Q
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_PLL1Q_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL1R
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_PLL1R_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL2P
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_PLL2P_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL2Q
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_PLL2Q_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_PLL2R
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_PLL2R_FREQUENCY
#  elif BOARD_SCICLK_SOURCE == RA_SCICLK_SRC_MOCO
#    define RA_SCICLK_SOURCE_FREQUENCY  RA_MOCO_FREQUENCY
#  else
#    error "BOARD_SCICLK_SOURCE is not a valid clock source"
#  endif
#  define RA_SCICLK_FREQUENCY \
  (RA_SCICLK_SOURCE_FREQUENCY / BOARD_SCICLK_DIVIDER)
#else
#  define RA_SCICLK_FREQUENCY     RA_MOCO_FREQUENCY
#endif

/* Package dependent limit for switching the system clock to the PLL.  The
 * switch has to happen with CPUCLK at or below this frequency (RA8M1 User's
 * Manual figures 8.13-8.15); CPUCLK is then raised by dropping its divider.
 * The package is the one of the selected part number (PLBG0224 = 224-pin
 * BGA, PLQP0176/0144/0100 = LQFP).  The "AM" package does not appear in the
 * manual, so it is treated like the most restrictive one.
 */

#if defined(CONFIG_ARCH_CHIP_R7FA8M1AFECBD) || \
    defined(CONFIG_ARCH_CHIP_R7FA8M1AHECBD)
#  define RA_PLL_SWITCH_MAX_CPUCLK  240000000
#elif defined(CONFIG_ARCH_CHIP_R7FA8M1AFECFC) || \
      defined(CONFIG_ARCH_CHIP_R7FA8M1AHECFC) || \
      defined(CONFIG_ARCH_CHIP_R7FA8M1AFECFB) || \
      defined(CONFIG_ARCH_CHIP_R7FA8M1AHECFB)
#  define RA_PLL_SWITCH_MAX_CPUCLK  200000000
#else
#  define RA_PLL_SWITCH_MAX_CPUCLK  180000000
#endif

/* Settling time after the system clock is switched to the PLL: 150 us with
 * the DCDC converter enabled, 10 us with an external VDD.
 */

#if BOARD_OFS2_DCDC
#  define RA_CLOCK_SETTLE_US        150
#else
#  define RA_CLOCK_SETTLE_US        10
#endif

/* Flash wait states (FCACHE.FLWT) required for the ICLK frequency */

#if RA_ICLK_FREQUENCY <= 48000000
#  define RA_FLASH_WAIT_STATES      0
#elif RA_ICLK_FREQUENCY <= 96000000
#  define RA_FLASH_WAIT_STATES      1
#elif RA_ICLK_FREQUENCY <= 144000000
#  define RA_FLASH_WAIT_STATES      2
#elif RA_ICLK_FREQUENCY <= 192000000
#  define RA_FLASH_WAIT_STATES      3
#else
#  define RA_FLASH_WAIT_STATES      4
#endif

/* Divider families: 3, 6 and 12 can not be mixed with 2, 4, 8, 16, 32, 64 */

#define RA_ANY_DIV_A \
  (RA_SCKDIV_FAMILY_A(BOARD_CPUCLK_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_ICLK_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_PCLKA_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_PCLKB_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_PCLKC_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_PCLKD_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_PCLKE_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_FCLK_DIVIDER) || \
   RA_SCKDIV_FAMILY_A(BOARD_BCLK_DIVIDER))
#define RA_ANY_DIV_B \
  (RA_SCKDIV_FAMILY_B(BOARD_CPUCLK_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_ICLK_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_PCLKA_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_PCLKB_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_PCLKC_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_PCLKD_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_PCLKE_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_FCLK_DIVIDER) || \
   RA_SCKDIV_FAMILY_B(BOARD_BCLK_DIVIDER))

/* CPUCLK divider used while the PLL is first selected as the system clock
 * when CPUCLK is above RA_PLL_SWITCH_MAX_CPUCLK: twice (or, in the 3/6/12
 * family, three times) slower than the final one.
 */

#if RA_ANY_DIV_B
#  define RA_CPUCLK_SWITCH_DIVIDER  (BOARD_CPUCLK_DIVIDER * 3)
#else
#  define RA_CPUCLK_SWITCH_DIVIDER  (BOARD_CPUCLK_DIVIDER * 2)
#endif

