apache/nuttx/arch/arm/src/ra8m1/ra_clockconfig.h
/* Checks against RA8M1 User's Manual chapter 8, Table 8.2 and its notes */

#if !RA_SCKDIV_VALID(BOARD_CPUCLK_DIVIDER) || \
    !RA_SCKDIV_VALID(BOARD_ICLK_DIVIDER)   || \
    !RA_SCKDIV_VALID(BOARD_PCLKA_DIVIDER)  || \
    !RA_SCKDIV_VALID(BOARD_PCLKB_DIVIDER)  || \
    !RA_SCKDIV_VALID(BOARD_PCLKC_DIVIDER)  || \
    !RA_SCKDIV_VALID(BOARD_PCLKD_DIVIDER)  || \
    !RA_SCKDIV_VALID(BOARD_PCLKE_DIVIDER)  || \
    !RA_SCKDIV_VALID(BOARD_FCLK_DIVIDER)   || \
    !RA_SCKDIV_VALID(BOARD_BCLK_DIVIDER)
#  error "System clock dividers must be 1, 2, 3, 4, 6, 8, 12, 16, 32 or 64"
#endif

#if RA_ANY_DIV_A && RA_ANY_DIV_B
#  error "Clock dividers of 3, 6 and 12 can not be mixed with 2, 4, 8, 16, 32 and 64"
#endif

#if RA_CPUCLK_FREQUENCY > 480000000
#  error "CPUCLK must be at most 480 MHz"
#endif
#if RA_ICLK_FREQUENCY > 240000000
#  error "ICLK must be at most 240 MHz"
#endif
#if RA_PCLKA_FREQUENCY > 120000000
#  error "PCLKA must be at most 120 MHz"
#endif
#if RA_PCLKB_FREQUENCY > 60000000
#  error "PCLKB must be at most 60 MHz"
#endif
#if RA_PCLKC_FREQUENCY > 60000000
#  error "PCLKC must be at most 60 MHz"
#endif
#if RA_PCLKD_FREQUENCY > 120000000
#  error "PCLKD must be at most 120 MHz"
#endif
#if RA_PCLKE_FREQUENCY > 240000000
#  error "PCLKE must be at most 240 MHz"
#endif
#if RA_FCLK_FREQUENCY > 60000000
#  error "FCLK must be at most 60 MHz"
#endif
#if RA_BCLK_FREQUENCY > 120000000
#  error "BCLK must be at most 120 MHz"
#endif

/* Frequency ordering and integer ratios: CPUCLK >= ICLK >= PCLKA >= PCLKB,
 * ICLK >= FCLK, ICLK >= BCLK, PCLKD >= PCLKA, CPUCLK:ICLK = N:1,
 * ICLK:{PCLKA, PCLKB, FCLK, BCLK} = N:1 and ICLK:{PCLKC, PCLKD, PCLKE} =
 * N:1 or 1:N.
 */

#if BOARD_ICLK_DIVIDER < BOARD_CPUCLK_DIVIDER || \
    (BOARD_ICLK_DIVIDER % BOARD_CPUCLK_DIVIDER) != 0
#  error "CPUCLK:ICLK must be an integer ratio with CPUCLK >= ICLK"
#endif
#if BOARD_PCLKA_DIVIDER < BOARD_ICLK_DIVIDER || \
    (BOARD_PCLKA_DIVIDER % BOARD_ICLK_DIVIDER) != 0
#  error "ICLK:PCLKA must be an integer ratio with ICLK >= PCLKA"
#endif
#if BOARD_PCLKB_DIVIDER < BOARD_PCLKA_DIVIDER
#  error "PCLKA must be at least PCLKB"
#endif
#if BOARD_PCLKB_DIVIDER < BOARD_ICLK_DIVIDER || \
    (BOARD_PCLKB_DIVIDER % BOARD_ICLK_DIVIDER) != 0
#  error "ICLK:PCLKB must be an integer ratio with ICLK >= PCLKB"
#endif
#if BOARD_FCLK_DIVIDER < BOARD_ICLK_DIVIDER || \
    (BOARD_FCLK_DIVIDER % BOARD_ICLK_DIVIDER) != 0
#  error "ICLK:FCLK must be an integer ratio with ICLK >= FCLK"
#endif
#if BOARD_BCLK_DIVIDER < BOARD_ICLK_DIVIDER || \
    (BOARD_BCLK_DIVIDER % BOARD_ICLK_DIVIDER) != 0
#  error "ICLK:BCLK must be an integer ratio with ICLK >= BCLK"
#endif
#if BOARD_PCLKD_DIVIDER > BOARD_PCLKA_DIVIDER
#  error "PCLKD must be at least PCLKA"
#endif
#if ((BOARD_PCLKC_DIVIDER % BOARD_ICLK_DIVIDER) != 0 && \
     (BOARD_ICLK_DIVIDER % BOARD_PCLKC_DIVIDER) != 0) || \
    ((BOARD_PCLKD_DIVIDER % BOARD_ICLK_DIVIDER) != 0 && \
     (BOARD_ICLK_DIVIDER % BOARD_PCLKD_DIVIDER) != 0) || \
    ((BOARD_PCLKE_DIVIDER % BOARD_ICLK_DIVIDER) != 0 && \
     (BOARD_ICLK_DIVIDER % BOARD_PCLKE_DIVIDER) != 0)
#  error "ICLK:PCLKC/PCLKD/PCLKE must be an integer ratio (N:1 or 1:N)"
#endif

/* When the HOCO feeds PLL1 the CPU clock is limited to 360 MHz */

#if RA_USE_PLL1 && BOARD_PLL1_SOURCE == R_SYSTEM_PLLCCR_PLSRCSEL && \
    RA_CPUCLK_FREQUENCY > 360000000
#  error "CPUCLK above 360 MHz needs the main oscillator as the PLL1 source"
#endif

/* Switching to the PLL: CPUCLK has to be at or below the package limit at
 * the moment of the switch, and raised afterwards with the divider.
 */

#if BOARD_SYSCLK_SOURCE == R_SYSTEM_SCKSCR_CKSEL_PLL && \
    RA_CPUCLK_FREQUENCY > RA_PLL_SWITCH_MAX_CPUCLK
#  if BOARD_CPUCLK_DIVIDER != 1
#    error "CPUCLK above the PLL switch limit needs a CPUCLK divider of 1"
#  endif
#  if (RA_SYSCLK_FREQUENCY / RA_CPUCLK_SWITCH_DIVIDER) > \
      RA_PLL_SWITCH_MAX_CPUCLK
#    error "CPUCLK is more than 2x (3x) the limit for switching to the PLL"
#  endif
#endif

#if RA_USE_SCICLK
#  if !RA_SCICLK_DIV_VALID(BOARD_SCICLK_DIVIDER)
#    error "SCICLK divider must be 1, 2, 3, 4, 5, 6 or 8"
#  endif
#  if RA_SCICLK_FREQUENCY > 120000000
#    error "SCICLK must be at most 120 MHz"
#  endif
#endif

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

#ifndef __ASSEMBLY__

/****************************************************************************
 * Public Data
 ****************************************************************************/

#undef EXTERN
#if defined(__cplusplus)
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: ra_clockconfig
 *
 * Description:
 *   Called to initialize the RA8M1.  This does whatever setup is needed to
 *   put the SoC in a usable state.  This includes starting the oscillators
 *   and PLLs, selecting the system clock source, setting the clock
 *   dividers and configuring the peripheral dedicated clocks, all from the
 *   BOARD_* clock options in board.h.
 *
 ****************************************************************************/

void ra_clockconfig(void);

#undef EXTERN
#if defined(__cplusplus)
}
#endif

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_ARM_SRC_RA8M1_RA_CLOCKCONFIG_H */
